DataProcessors/ОбработкаИмпортаВедомостейСДоговорами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаИмпортаВедомостейСДоговорами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Ведомость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВедомости</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВедомости</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акцептован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Ведомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Ведомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВедомостьДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.СимволыВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Литеры</Name>
					<Comment>Строковые символы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыСтрокой</Name>
					<Comment>Перечень ГУИД ссылок справочника договоры (разделитель";")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорыТаблицей</Name>
					<Comment>Таблица значений с колонкой из ссылок справочника  договоры</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иконки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь создавший документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаИмпортаВедомостейСДоговорами/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выбор файла";
	Проводник.Фильтр = "Файл Excel (*.xlsx;*.xls)|*.xlsx;*.xls";
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	
	ОчиститьСообщения();
	
	Если ВыборИзСписка = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран способ хранения договоров.'"));
		
		Возврат;
		
	КонецЕсли;
	
	СозданиеОбъектов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДействияДляИмпортаФайла

// Завершение поиска и выбора файла.
//
&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
	
	ПрочитатьФайл();
	
КонецПроцедуры

// Заполняет табличную часть формы обработки информацией из импортируемого файла.
//
&НаКлиенте
Процедура ПрочитатьФайл()
	
	Объект.ДанныеФайла.Очистить();
	
	ПрочитатьТекстовыеДанные_XLS();
	
КонецПроцедуры

// Подготовка адресной информации о местоположении файла импорта и его расширении.
//
&НаКлиенте
Процедура ПрочитатьТекстовыеДанные_XLS() 
	
	ВыбФайл = Новый Файл(Объект.ПутьКФайлу);
	РасширениеФайла = Прав(ВыбФайл.Расширение, СтрДлина(ВыбФайл.Расширение) - 1);
	
	ДанныеФайла = Новый ДвоичныеДанные(Объект.ПутьКФайлу);
	АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДанныеФайла);
	
	ПрочитатьТекстовыеДанные_XLS_НаСервере(АдресДанныхФайла, РасширениеФайла);
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры 

// Чтение файлового документа и заполнение табличной части формы обработки.
//
// Параметры:
//  АдресФайла  - Строка - адрес временного хранилища с местоположением файла импорта.
//  РасширениеФайла  - Строка - расширение файла импорта.
//
&НаСервере
Процедура ПрочитатьТекстовыеДанные_XLS_НаСервере(АдресФайла, РасширениеФайла)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ДвоичныДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныДанные.Записать(ПутьКФайлуНаСервере);
	
	Попытка
		
		ТабДок.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		
	Исключение
		
		Информация = "Неудалось прочитать файл по причине: " + ОписаниеОшибки();
		
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
		
		Возврат;
		
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	
	СуществующиеВедомости = ДанныеВедомостейИзБазы(ТабДок, КоличествоСтрок);
	СуществующиеДоговора = ДанныеДоговоровИзБазы(ТабДок, КоличествоСтрок);
	
	Для НомерСтроки = 2 По КоличествоСтрок - 2 Цикл
		
		ВедомостьИзБазы = СуществующиеВедомости.Найти(ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст);
		НомерВедомостиИзФайла = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст;
		
		Если ВедомостьИзБазы <> Неопределено И НомерВедомостиИзФайла = ВедомостьИзБазы[0] Тогда
			
			ДанныеОбъекта = Объект.ДанныеФайла.НайтиСтроки(Новый Структура("Ведомость", ВедомостьИзБазы[1]));
			
			Если ДанныеОбъекта.Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДанных = Объект.ДанныеФайла.Добавить();
			СтрокаДанных.Ведомость = ВедомостьИзБазы[1];
			СтрокаДанных.ДатаВедомости = Формат(ВедомостьИзБазы[2], "ДФ='dd.MM.yy HH:mm'"); 
			
		Иначе
			
			СтрокаДанных = Объект.ДанныеФайла.Добавить();
			СтрокаДанных.НомерВедомости = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 1).ТекущаяОбласть.Текст;
			СтрокаДанных.ДатаВедомости = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 2).ТекущаяОбласть.Текст;
			
			НаименованиеДоговораИзФайла = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 3).ТекущаяОбласть.Текст;
			НачалоДействияИзФайла = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 5).ТекущаяОбласть.Текст;
			ОкончаниеДействияИзФайла = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 6).ТекущаяОбласть.Текст;
			
			ДоговорИзБазы = СуществующиеДоговора.Найти(НаименованиеДоговораИзФайла);
			
			Если ДоговорИзБазы <> Неопределено И НачалоДействияИзФайла = ДоговорИзБазы[2] И ОкончаниеДействияИзФайла = ДоговорИзБазы[3] Тогда
				
				СтрокаДанных.Договор = ДоговорИзБазы[0];
				СтрокаДанных.Активен = ДоговорИзБазы[4];
				
			Иначе
				
				СтрокаДанных.НаименованиеДоговора = НаименованиеДоговораИзФайла;
				СтрокаДанных.Активен = ТабДок.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + 4).ТекущаяОбласть.Текст;
				
				СтрокаДанных.НачалоДействия = НачалоДействияИзФайла;
				СтрокаДанных.ОкончаниеДействия = ОкончаниеДействияИзФайла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает ведомости из базы которые есть в файле импорта.
//
// Параметры:
//  ТабДок  - ТабличныйДокумент - данные ведомостей импортированные из файла.
//  КоличествоСтрок  - Число - количество строк табличного документа с импортированными данными.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - коллекция данных ведомостей из базы.
//
&НаСервере
Функция ДанныеВедомостейИзБазы(ТабДок, КоличествоСтрок)
	
	ОбластьЯчеек = ТабДок.Область(1, 1, КоличествоСтрок - 2, 1);
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	ТабЗначений.Свернуть("НомерВедомости");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.НомерВедомости КАК НомерВедомости
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ведомость.Номер КАК Номер,
	|	Ведомость.Ссылка КАК Ссылка,
	|	Ведомость.Дата КАК Дата
	|ИЗ
	|	Документ.Ведомость КАК Ведомость,
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	Ведомость.Номер = ТЗ.НомерВедомости";
	
	Запрос.УстановитьПараметр("ТЗ", ТабЗначений);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЧислоВедомостейВБазе = Результат.Количество();
	
	Возврат Результат;
	
КонецФункции

// Возвращает договоры из базы которые есть в файле импорта.
//
// Параметры:
//  ТабДок  - ТабличныйДокумент - данные договоров импортированные из файла.
//  КоличествоСтрок  - Число - количество строк табличного документа с импортированными данными.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - коллекция данных договоров из базы.
//
&НаСервере
Функция ДанныеДоговоровИзБазы(ТабДок, КоличествоСтрок)
	
	ОбластьЯчеек = ТабДок.Область(1, 3, КоличествоСтрок - 2, 3);
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	ТабЗначений.Свернуть("НаименованиеДоговора");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.НаименованиеДоговора КАК НаименованиеДоговора
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Наименование КАК Наименование,
	|	ПОДСТРОКА(СТРОКА(Договоры.НачалоДействия), 1, 10) КАК НачалоДействия,
	|	ПОДСТРОКА(СТРОКА(Договоры.ОкончаниеДействия), 1, 10) КАК ОкончаниеДействия,
	|	Договоры.Активен КАК Активен
	|ИЗ
	|	Справочник.Договоры КАК Договоры,
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	Договоры.Наименование = ТЗ.НаименованиеДоговора";
	
	Запрос.УстановитьПараметр("ТЗ", ТабЗначений);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЧислоДоговоровйВБазе = Результат.Количество();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДействияДляСозданияОбъектов

// Создает и возвращает форму документа Ведомость для записи нового объекта в базу.
//
// Параметры:
//  СтрокаТаблицы  - ДанныеФормыЭлементКоллекции - строка табличной части формы обработки.
// Возвращаемое значение:
//   ФормаКлиентскогоПриложения>   - форма создания нового документа Ведомость.
//
&НаСервере
Функция НовыйДокументВедомость(СтрокаТаблицы)
	
	НовыйДокумент = Документы.Ведомость.СоздатьДокумент();
	Форма = НовыйДокумент.ПолучитьФорму("Документ.Ведомость.Форма.ФормаДокумента");
	Форма.Объект.Дата = Дата(СтрокаТаблицы.ДатаВедомости + ":00");
	Форма.Объект.Номер = СтрокаТаблицы.НомерВедомости;
	Форма.Объект.СтатусДокумента = Перечисления.Статус.Черновик;
	
	Возврат Форма;
	
КонецФункции

// Возврат формы документа с заполненной табличной частью, согласно выбранному способу хранения договоров.
//
// Параметры:
//  ФормаДокумента  - ФормаКлиентскогоПриложения - форма нового документа Ведомость.
//  ВыбраннаяТабличнаяЧасть  - Число - способ сохранения договора.
//  Договор  - СправочникСсылка.Договоры - договор принадлежащий документу.
//
// Возвращаемое значение:
//   ФормаКлиентскогоПриложения   - форма нового документа Ведомость.
//
&НаСервере
Функция СпособХраненияДоговоров(ФормаДокумента, ВыбраннаяТабличнаяЧасть, Договор)
	
	Если ВыбраннаяТабличнаяЧасть = 1 Тогда
		СтрокаТаблицы = ФормаДокумента.ДоговорыВСтроке.Добавить();
		СтрокаТаблицы.Договор = Договор;
	ИначеЕсли ВыбраннаяТабличнаяЧасть = 2 Тогда
		СтрокаТаблицы = ФормаДокумента.Объект.Договоры.Добавить();
		СтрокаТаблицы.Договор = Договор;
	ИначеЕсли ВыбраннаяТабличнаяЧасть = 3 Тогда
		СтрокаТаблицы = ФормаДокумента.ДоговорыВРегистре.Добавить();
		СтрокаТаблицы.Договор = Договор;
	ИначеЕсли ВыбраннаяТабличнаяЧасть = 4 Тогда
		СтрокаТаблицы = ФормаДокумента.ДоговорыВХранилище.Добавить();
		СтрокаТаблицы.Договор = Договор;
	КонецЕсли;
	
	Возврат ФормаДокумента;
	
КонецФункции

// Заполняет табличную часть формы обработки ссылками импортируемых новых договоров уже сохраненных в базе.
//
// Параметры:
//  Договор  - СправочникСсылка.Договоры - созданный новый договор принадлежащий документу.
//  Наименование  - Строка - наименование нового договора
//
&НаСервере
Процедура ЗаполнениеСсылкиНаДоговорВТаблице(Договор, Наименование)
	
	МассивСтрокСДоговорами = Объект.ДанныеФайла.НайтиСтроки(Новый Структура("НаименованиеДоговора", Наименование));
	
	Для каждого Строка Из МассивСтрокСДоговорами Цикл
		Строка.Договор = Договор;
	КонецЦикла;
	
КонецПроцедуры

// Создание новых договоров и заполнение выбранной табличной части способа хранения в новом документе Ведомость, сохранение документа.
//
&НаСервере
Процедура СозданиеОбъектов()
	
	ЧислоОшибкокПриИмпорте = 0;
	СозданныеВедомости = Новый СписокЗначений;
	СозданныеДоговора = Новый Соответствие;
	
	Для Каждого СтрокаКоллекцииЗагруженныхДанных Из Объект.ДанныеФайла Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаКоллекцииЗагруженныхДанных.Ведомость) Тогда
			
			Если СозданныеВедомости.НайтиПоЗначению(СтрокаКоллекцииЗагруженныхДанных.НомерВедомости) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДоговорыДокумента = Объект.ДанныеФайла.НайтиСтроки(Новый Структура("НомерВедомости", СтрокаКоллекцииЗагруженныхДанных.НомерВедомости));
			
			ФормаДокументаВедомость = НовыйДокументВедомость(СтрокаКоллекцииЗагруженныхДанных);
			
			Для каждого ЭлементКоллекции Из ДоговорыДокумента Цикл
				
				ЗаписанныйДоговор = СозданныеДоговора.Получить(ЭлементКоллекции.НаименованиеДоговора);
				
				Если ЗаписанныйДоговор <> Неопределено Тогда
					
					ФормаДокументаВедомость = СпособХраненияДоговоров(ФормаДокументаВедомость, ВыборИзСписка, ЗаписанныйДоговор.Ссылка);
					
					Продолжить;
					
				ИначеЕсли ЗначениеЗаполнено(ЭлементКоллекции.Договор) Тогда
					
					ФормаДокументаВедомость = СпособХраненияДоговоров(ФормаДокументаВедомость, ВыборИзСписка, ЭлементКоллекции.Договор.Ссылка);
					
					Продолжить;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ЭлементКоллекции.Договор) Тогда
					
					НовыйЭлемент = Справочники.Договоры.СоздатьЭлемент();
					НовыйЭлемент.Наименование = ЭлементКоллекции.НаименованиеДоговора;
					НовыйЭлемент.Активен = ЭлементКоллекции.Активен;
					НовыйЭлемент.НачалоДействия = Дата(ЭлементКоллекции.НачалоДействия + " 00:00:00");
					НовыйЭлемент.ОкончаниеДействия = Дата(ЭлементКоллекции.ОкончаниеДействия + " 00:00:00");
					
					Попытка
						
						НовыйЭлемент.Записать();
						
						ЗаполнениеСсылкиНаДоговорВТаблице(НовыйЭлемент.Ссылка, НовыйЭлемент.Наименование);
						ФормаДокументаВедомость = СпособХраненияДоговоров(ФормаДокументаВедомость, ВыборИзСписка, НовыйЭлемент.Ссылка);
						СозданныеДоговора.Вставить(НовыйЭлемент.Наименование, НовыйЭлемент.Ссылка);
						
					Исключение
						
						ЧислоОшибкокПриИмпорте = ЧислоОшибкокПриИмпорте + 1;
						
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Данные.Запись'"),
							УровеньЖурналаРегистрации.Ошибка, Справочники.Договоры, НовыйЭлемент.Наименование,
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Попытка
				
				ФормаДокументаВедомость.Записать();
				
			Исключение
				
				ЧислоОшибкокПриИмпорте = ЧислоОшибкокПриИмпорте + 1;
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Данные.Запись'"),
					УровеньЖурналаРегистрации.Ошибка, Документы.Ведомость, ФормаДокументаВедомость.НомерВедомости,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			КонецПопытки;
			
			СозданныеВедомости.Добавить(ФормаДокументаВедомость.Объект.Номер);
			
			СтрокиВедомости = Объект.ДанныеФайла.НайтиСтроки(Новый Структура("НомерВедомости", СтрокаКоллекцииЗагруженныхДанных.НомерВедомости));
			
			Для каждого СтрокаКоллекцииЗагруженныхДанных Из СтрокиВедомости Цикл
				СтрокаКоллекцииЗагруженныхДанных.Ведомость = ФормаДокументаВедомость.Объект.Ссылка;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИнформироватьПользователя(СозданныеВедомости.Количество(), СозданныеДоговора.Количество(), ЧислоОшибкокПриИмпорте);
	
КонецПроцедуры

// Информирование пользователя о действиях с объектами импортируемых из файла.
//
// Параметры:
//  СозданныеВедомости  - Число - количество ведомостей записанных в базу.
//  СозданныеДоговора  - Число - количество договоров записанных в базу.
//  ЧислоОшибкокПриИмпорте  - Число - количество ошибок записи объектов.
//
&НаСервере
Процедура ИнформироватьПользователя(СозданныеВедомости, СозданныеДоговора, ЧислоОшибкокПриИмпорте)
	
	Если ЧислоОшибкокПриИмпорте > 0 Тогда
		
		Информация = СтрШаблон(
			"Документов создано: %1; уже было в базе: %2. Договоров создано: %3; уже было в базе: %4. Ошибок при импорте: %5. Описание см в журнале регистрации.",
			СозданныеВедомости, ЧислоВедомостейВБазе, СозданныеДоговора, ЧислоДоговоровйВБазе, ЧислоОшибкокПриИмпорте);
		
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
		
	Иначе
		
		Информация = СтрШаблон(
			"Документов создано: %1; уже было в базе: %2. Договоров создано: %3; уже было в базе: %4. Ошибок при импорте файла не возникло.",
			СозданныеВедомости, ЧислоВедомостейВБазе, СозданныеДоговора, ЧислоДоговоровйВБазе);
		
		ОбщегоНазначенияСлужебныйСервер.ИнформироватьПользователя(Информация);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
